test-inputs/2.txt

POST /bar/qux HTTP/1.1
Content-Length: 369
Host: weirdport.foo.bar:8081
Content-Type: text/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://hu/xxxxxxxxx/ws" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><ns0:Body><ns1:yyyyyyyyyyyy><ns1:request/></ns1:yyyyyyyyyyyy></ns0:Body></SOAP-ENV:Envelope>
